{"keras_version": "2.1.2", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "trainable": true, "bias_regularizer": null, "dtype": "float32", "kernel_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "filters": 32, "dilation_rate": [1, 1], "kernel_size": [3, 3], "use_bias": true, "name": "conv2d_9", "batch_input_shape": [null, 28, 28, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_9"}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true, "filters": 32, "bias_constraint": null, "kernel_size": [3, 3], "padding": "valid", "name": "conv2d_10", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_10"}}, {"class_name": "Flatten", "config": {"name": "flatten_5", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "units": 128, "activation": "relu", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "use_bias": true, "name": "dense_9"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "units": 10, "activation": "softmax", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "use_bias": true, "name": "dense_10"}}], "backend": "tensorflow"}